prod/freebsd/bench/6t_bench_5min.txt
❯ ./wagtail-bench.sh https://hanz.jsmx.org/
==================================================
 wrk2 Benchmark – Phase 1: Scout (finding ceiling)
==================================================
Target      : https://hanz.jsmx.org/
Connections : 300 (max users)
Duration    : 60s
Target RPS  : 10,000,000 (intentionally over‑shot)
--------------------------------------------------
✅ Scout complete. Maximum sustainable RPS = 2182.23 req/s

⏸  Cooling down for 30s before soak phase...
   ✅ Cooldown complete.

==================================================
 wrk2 Benchmark – Phase 2: Soak (long‑term stability)
==================================================
Target      : https://hanz.jsmx.org/
Connections : 300
Duration    : 300s
Target RPS  : 1746 (80% of max)
--------------------------------------------------
⏳ Running soak test – this will take 300s...

Initialised 6 threads in 0 ms.
Running 5m test @ https://hanz.jsmx.org/
  6 threads and 300 connections
  Thread calibration: mean lat.: 82.420ms, rate sampling interval: 218ms
  Thread calibration: mean lat.: 95.340ms, rate sampling interval: 248ms
  Thread calibration: mean lat.: 103.849ms, rate sampling interval: 269ms
  Thread calibration: mean lat.: 77.988ms, rate sampling interval: 238ms
  Thread calibration: mean lat.: 97.069ms, rate sampling interval: 247ms
  Thread calibration: mean lat.: 101.586ms, rate sampling interval: 252ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    90.28ms  182.23ms   7.73s    99.44%
    Req/Sec   291.09     59.28   475.00     60.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   80.77ms
 75.000%  103.94ms
 90.000%  113.66ms
 99.000%  182.78ms
 99.900%    2.55s
 99.990%    7.24s
 99.999%    7.70s
100.000%    7.73s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      40.735     0.000000            1         1.00
      52.895     0.100000        50721         1.11
      59.039     0.200000       101340         1.25
      65.151     0.300000       151834         1.43
      72.447     0.400000       202498         1.67
      80.767     0.500000       252988         2.00
      85.503     0.550000       278509         2.22
      89.983     0.600000       303645         2.50
      94.655     0.650000       329043         2.86
      99.519     0.700000       354252         3.33
     103.935     0.750000       379737         4.00
     105.791     0.775000       392492         4.44
     107.391     0.800000       405192         5.00
     108.799     0.825000       417538         5.71
     110.207     0.850000       430234         6.67
     111.679     0.875000       442724         8.00
     112.575     0.887500       449064         8.89
     113.663     0.900000       455239        10.00
     115.263     0.912500       461577        11.43
     118.079     0.925000       468018        13.33
     120.447     0.937500       474387        16.00
     121.343     0.943750       477473        17.78
     122.239     0.950000       480558        20.00
     123.263     0.956250       483788        22.86
     124.735     0.962500       486935        26.67
     127.359     0.968750       490026        32.00
     129.983     0.971875       491617        35.56
     133.503     0.975000       493197        40.00
     138.367     0.978125       494785        45.71
     143.359     0.981250       496349        53.33
     150.527     0.984375       497933        64.00
     155.647     0.985938       498708        71.11
     161.791     0.987500       499506        80.00
     171.903     0.989062       500289        91.43
     193.663     0.990625       501086       106.67
     253.439     0.992188       501877       128.00
     260.095     0.992969       502268       142.22
     266.495     0.993750       502671       160.00
     274.687     0.994531       503061       182.86
     285.183     0.995313       503454       213.33
     294.399     0.996094       503860       256.00
     298.239     0.996484       504048       284.44
     306.175     0.996875       504248       320.00
     312.831     0.997266       504439       365.71
     327.423     0.997656       504636       426.67
     354.815     0.998047       504835       512.00
     381.183     0.998242       504932       568.89
     432.895     0.998437       505031       640.00
     537.087     0.998633       505130       731.43
    2154.495     0.998828       505229       853.33
    2557.951     0.999023       505328      1024.00
    3071.999     0.999121       505377      1137.78
    4085.759     0.999219       505444      1280.00
    4091.903     0.999316       505480      1462.86
    4165.631     0.999414       505526      1706.67
    6021.119     0.999512       505575      2048.00
    6483.967     0.999561       505603      2275.56
    6488.063     0.999609       505628      2560.00
    7167.999     0.999658       505649      2925.71
    7172.095     0.999707       505678      3413.33
    7176.191     0.999756       505730      4096.00
    7176.191     0.999780       505730      4551.11
    7176.191     0.999805       505730      5120.00
    7180.287     0.999829       505738      5851.43
    7188.479     0.999854       505748      6826.67
    7213.055     0.999878       505761      8192.00
    7225.343     0.999890       505766      9102.22
    7237.631     0.999902       505772     10240.00
    7249.919     0.999915       505778     11702.86
    7319.551     0.999927       505784     13653.33
    7610.367     0.999939       505791     16384.00
    7688.191     0.999945       505800     18204.44
    7688.191     0.999951       505800     20480.00
    7688.191     0.999957       505800     23405.71
    7692.287     0.999963       505813     27306.67
    7692.287     0.999969       505813     32768.00
    7692.287     0.999973       505813     36408.89
    7692.287     0.999976       505813     40960.00
    7692.287     0.999979       505813     46811.43
    7692.287     0.999982       505813     54613.33
    7696.383     0.999985       505814     65536.00
    7700.479     0.999986       505815     72817.78
    7700.479     0.999988       505815     81920.00
    7704.575     0.999989       505816     93622.86
    7712.767     0.999991       505817    109226.67
    7716.863     0.999992       505818    131072.00
    7716.863     0.999993       505818    145635.56
    7716.863     0.999994       505818    163840.00
    7725.055     0.999995       505820    187245.71
    7725.055     0.999995       505820    218453.33
    7725.055     0.999996       505820    262144.00
    7725.055     0.999997       505820    291271.11
    7725.055     0.999997       505820    327680.00
    7725.055     0.999997       505820    374491.43
    7725.055     0.999998       505820    436906.67
    7729.151     0.999998       505821    524288.00
    7729.151     1.000000       505821          inf
#[Mean    =       90.281, StdDeviation   =      182.234]
#[Max     =     7725.056, Total count    =       505821]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  522209 requests in 5.00m, 4.42GB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:   1740.44
Transfer/sec:     15.10MB

================= FINAL RESULTS =================
Max RPS (ceiling)      : 2182.23 req/s
Soak RPS (target)      : 1746 req/s
Soak RPS (achieved)    : 1740.44 req/s
Total requests         : 522209
Transfer rate          : 15.10MB/s

Latency (average)      : 90.28ms
Latency (stdev)        : 182.23ms
Latency (max)          : 7.73s
Latency (p50)          : 80.77ms
Latency (p90)          : 113.66ms
Latency (p99)          : 182.78ms
Latency (p99.9)        : 2.55s
Socket errors          : connect 0, read 0, write 0, timeout 1
✅ Benchmark complete.